### Dealing with the Database

In [1]:
# creation of Database
import sqlite3    # importing the required module

In [2]:
# use the database if it pre-exists or create a new one
connection = sqlite3.connect("myemp.db")

In [ ]:
# SQlite Manager Online URL: https://extendsclass.com/sqlite-browser.html

In [3]:
# create employee table as employee(emp_id, emp_name, emp_city, emp_salary)
sqlStr = '''
         CREATE TABLE employee (
         emp_id INTEGER PRIMARY KEY,
         emp_name TEXT,
         emp_city TEXT,
         emp_salary REAL);
         '''
try:   # create the table if it does not pre-exist
    connection.execute(sqlStr)
    print ("Database table has been created successfully...")
except:
    print ("Error !!! Database table could not be created successfully...")

Database table has been created successfully...

In [12]:
# inserting records into the database table after reading data from the CSV file
import csv
sqlStr = "INSERT INTO employee VALUES ('{emp_id_ph}', '{emp_name_ph}', '{emp_city_ph}', '{emp_salary_ph}');"

# read lines from the csv file and store them into the database table
with open('emp_data.csv') as data_file:
    csv_reader = csv.reader(data_file)
    # print (len(list(csv_reader)))
    print (list(csv_reader))
# csv_reader = csv.reader(data_file)

[['1001', 'Dhiman', 'Kolkata', '39000'], ['1002', 'Anupam', 'Kolkata', '25000'], ['1003', 'Subham', 'Mumbai', '36000'], ['1004', 'Dinesh', 'Chennai', '28000'], ['1005', 'Kakali', 'Mumbai', '25000'], ['1006', 'Bimal', 'Hyderabad', '30000'], ['1007', 'Tarun', 'Chennai', '17000'], ['1008', 'Rittik', 'Durgapur', '45000'], ['1009', 'Barun', 'Hyderabad', '39000'], ['1010', 'Utpal', 'Lucknow', '20000']]

In [14]:
# inserting records into the database table after reading data from the CSV file
import csv
sqlStr = "INSERT INTO employee VALUES ('{emp_id_ph}', '{emp_name_ph}', '{emp_city_ph}', '{emp_salary_ph}');"

# read lines from the csv file and store them into the database table
with open('emp_data.csv') as data_file:
    csv_reader = csv.reader(data_file)
    for row in csv_reader:
        print (row)
        connection.execute(sqlStr.format(emp_id_ph = row[0], emp_name_ph = row[1], emp_city_ph = row[2], emp_salary_ph = row[3]))
        
connection.commit()   # making the change or records enrty to the table permanent
print ("All record entries have been completed successfully...")

['1001', 'Dhiman', 'Kolkata', '39000']
['1002', 'Anupam', 'Kolkata', '25000']
['1003', 'Subham', 'Mumbai', '36000']
['1004', 'Dinesh', 'Chennai', '28000']
['1005', 'Kakali', 'Mumbai', '25000']
['1006', 'Bimal', 'Hyderabad', '30000']
['1007', 'Tarun', 'Chennai', '17000']
['1008', 'Rittik', 'Durgapur', '45000']
['1009', 'Barun', 'Hyderabad', '39000']
['1010', 'Utpal', 'Lucknow', '20000']
All record entries have been completed successfully...

In [15]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
print (list(cur_table))

[(1001, 'Dhiman', 'Kolkata', 39000.0), (1002, 'Anupam', 'Kolkata', 25000.0), (1003, 'Subham', 'Mumbai', 36000.0), (1004, 'Dinesh', 'Chennai', 28000.0), (1005, 'Kakali', 'Mumbai', 25000.0), (1006, 'Bimal', 'Hyderabad', 30000.0), (1007, 'Tarun', 'Chennai', 17000.0), (1008, 'Rittik', 'Durgapur', 45000.0), (1009, 'Barun', 'Hyderabad', 39000.0), (1010, 'Utpal', 'Lucknow', 20000.0)]

In [16]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}")

Emp-ID: 1001, Emp-Name: Dhiman, Emp-City: Kolkata, Emp-Salary: 39000.0
Emp-ID: 1002, Emp-Name: Anupam, Emp-City: Kolkata, Emp-Salary: 25000.0
Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 28000.0
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 17000.0
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0

In [18]:
# SQL for fetching emp_name and emp_salary of those employees whose emp_salary is greater than 30000
sqlStr = "SELECT emp_name, emp_salary FROM employee WHERE emp_salary > 30000;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-Name: {row[0]} and Emp-Salary: {row[1]}...")

Emp-Name: Dhiman and Emp-Salary: 39000.0...
Emp-Name: Subham and Emp-Salary: 36000.0...
Emp-Name: Rittik and Emp-Salary: 45000.0...
Emp-Name: Barun and Emp-Salary: 39000.0...

In [20]:
# SQL query to fetch emp_name, emp_salary and 10% of the emp_salary as TDS against emp_salaries of all employees
sqlStr = "SELECT emp_name, emp_salary, emp_salary * 0.10 FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-Name: {row[0]}, Emp-Salary: {row[1]} and Emp-TDS: {row[2]}...")

Emp-Name: Dhiman, Emp-Salary: 39000.0 and Emp-TDS: 3900.0...
Emp-Name: Anupam, Emp-Salary: 25000.0 and Emp-TDS: 2500.0...
Emp-Name: Subham, Emp-Salary: 36000.0 and Emp-TDS: 3600.0...
Emp-Name: Dinesh, Emp-Salary: 28000.0 and Emp-TDS: 2800.0...
Emp-Name: Kakali, Emp-Salary: 25000.0 and Emp-TDS: 2500.0...
Emp-Name: Bimal, Emp-Salary: 30000.0 and Emp-TDS: 3000.0...
Emp-Name: Tarun, Emp-Salary: 17000.0 and Emp-TDS: 1700.0...
Emp-Name: Rittik, Emp-Salary: 45000.0 and Emp-TDS: 4500.0...
Emp-Name: Barun, Emp-Salary: 39000.0 and Emp-TDS: 3900.0...
Emp-Name: Utpal, Emp-Salary: 20000.0 and Emp-TDS: 2000.0...

In [23]:
# SQL query to display citywise average salaries from the employee database table
sqlStr = "SELECT emp_city, avg(emp_salary) from employee GROUP BY emp_city;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-City: {row[0]} and Emp-Avg_Salary: {row[1]}...")

Emp-City: Chennai and Emp-Avg_Salary: 22500.0...
Emp-City: Durgapur and Emp-Avg_Salary: 45000.0...
Emp-City: Hyderabad and Emp-Avg_Salary: 34500.0...
Emp-City: Kolkata and Emp-Avg_Salary: 32000.0...
Emp-City: Lucknow and Emp-Avg_Salary: 20000.0...
Emp-City: Mumbai and Emp-Avg_Salary: 30500.0...

In [24]:
# update operation on the records of the table
# update emp_salary to 30000 where emp_city is 'Chennai'
sqlStr = "UPDATE employee SET emp_salary = 30000 WHERE emp_city = 'Chennai';"
table = connection.execute(sqlStr)
connection.commit()    # to make the change permanent
print ("So the number of records got updated is", table.rowcount)

So the number os records got updated is 2

In [25]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}")

Emp-ID: 1001, Emp-Name: Dhiman, Emp-City: Kolkata, Emp-Salary: 39000.0
Emp-ID: 1002, Emp-Name: Anupam, Emp-City: Kolkata, Emp-Salary: 25000.0
Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0

In [26]:
# delete records frok the table
# delete those records where city is 'Kolkata'
sqlStr = "DELETE FROM employee WHERE emp_city = 'Kolkata';"
table = connection.execute(sqlStr)
connection.commit()    # to make the change permanent
print ("So the number of records got updated is", table.rowcount)

So the number of records got updated is 2

In [27]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}")

Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0

### Assignment:
============<br>
**Enter n number of records from the user input and insert them into the employee database table and display all the records.**

In [31]:
# fetching records from the database table and putting them into the Pandas DataFrame.
import pandas as pd
df = pd.read_sql_query("SELECT * FROM employee;", connection)
print (df.shape, type(df))
df

(8, 4) <class 'pandas.core.frame.DataFrame'>

   emp_id emp_name   emp_city  emp_salary
0    1003   Subham     Mumbai     36000.0
1    1004   Dinesh    Chennai     30000.0
2    1005   Kakali     Mumbai     25000.0
3    1006    Bimal  Hyderabad     30000.0
4    1007    Tarun    Chennai     30000.0
5    1008   Rittik   Durgapur     45000.0
6    1009    Barun  Hyderabad     39000.0
7    1010    Utpal    Lucknow     20000.0

In [33]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = "SELECT * FROM employee WHERE emp_city = 'Hyderabad' or emp_city = 'Chennai';"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}")

Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 30000.0
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0

In [34]:
# displaying all the records available in the database table
# SQL for fetching all records from the table
sqlStr = """SELECT *
            FROM employee
            WHERE emp_salary IN 
                (
                    SELECT MAX(emp_salary)
                    FROM employee
                );"""
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
# print (list(cur_table))
for row in cur_table:
    print (f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}")

Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0

In [35]:
connection.close()